health_tips = {
    # Common conditions
    
  "fever": "Drink plenty of fluids, rest, take paracetamol if necessary, and consult a doctor if fever is high or persists.",
  "cough": "Stay hydrated, take honey with warm water, avoid cold drinks, and see a doctor if it lasts over 2 weeks.",
  "cold": "Rest, drink warm fluids, steam inhalation, and consult a doctor if symptoms worsen.",
  "flu": "Get plenty of rest, drink fluids, and take paracetamol or ibuprofen for fever. Seek medical advice if severe.",
  "headache": "Rest in a quiet, dark room, drink water, and take mild pain relief. Seek medical help if severe or frequent.",
  "migraine": "Avoid triggers, rest in a dark quiet place, apply cold compress, and take prescribed medications.",
  "stomachache": "Eat light meals, avoid spicy/oily foods, and drink plenty of fluids. Consult a doctor if pain continues.",
  "diarrhea": "Drink oral rehydration solution (ORS), avoid oily/spicy food, and see a doctor if dehydration occurs.",
  "constipation": "Eat fiber-rich foods, drink water, and exercise regularly.",
  "sore throat": "Gargle with warm salt water, drink warm fluids, and use lozenges.",
  "allergy": "Avoid allergens, keep windows closed, use antihistamines if prescribed.",
  "asthma": "Use prescribed inhalers, avoid dust/smoke, and consult a doctor for persistent attacks.",
  "bronchitis": "Rest, drink fluids, avoid smoke, and consult a doctor for prolonged symptoms.",
  "pneumonia": "Consult a doctor immediately, rest, drink fluids, and follow prescribed antibiotics.",
  "chest pain": "Could indicate heart issues. Seek emergency medical help immediately.",
  "heartburn": "Avoid spicy/acidic foods, eat smaller meals, and avoid lying down immediately after eating.",
  "indigestion": "Eat slowly, avoid fatty/spicy food, and take antacids if necessary.",
  "ulcer": "Avoid alcohol/spicy food, take doctor-prescribed medication, and reduce stress.",
  "gastritis": "Avoid spicy/fried food, take antacids, and consult a doctor if pain persists.",
  "food poisoning": "Drink fluids, eat bland food, and seek medical attention if severe dehydration occurs.",
  "toothache": "Rinse with warm salt water, use a cold compress, and consult a dentist.",
  "gum disease": "Brush and floss regularly, use mouthwash, and consult a dentist.",
  "back pain": "Maintain good posture, do stretching exercises, apply hot/cold compress.",
  "neck pain": "Practice good posture, apply heat/ice, and do gentle exercises.",
  "shoulder pain": "Rest, use cold compress, and seek physiotherapy if persistent.",
  "arthritis": "Exercise regularly, take anti-inflammatory medication as prescribed, and maintain healthy weight.",
  "osteoporosis": "Consume calcium and vitamin D, do weight-bearing exercise, and take prescribed medication.",
  "diabetes": "Monitor blood sugar, eat a balanced diet, exercise regularly, and take prescribed medication.",
  "hypertension": "Reduce salt intake, exercise, avoid stress, and take doctor-prescribed medication.",
  "hypotension": "Drink water, avoid alcohol, and eat small frequent meals.",
  "anemia": "Eat iron-rich food, take iron supplements if prescribed, and monitor blood levels.",
  "obesity": "Follow a balanced diet, exercise regularly, and consult a nutritionist.",
  "malnutrition": "Consume nutrient-rich food, take supplements as prescribed, and consult a doctor.",
  "dehydration": "Drink ORS/water, avoid alcohol/caffeine, and seek medical help if severe.",
  "sunburn": "Apply aloe vera gel, stay hydrated, and avoid sun exposure.",
  "heat stroke": "Move to a cool place, drink fluids, and seek emergency medical help.",
  "frostbite": "Warm the affected area gradually, avoid rubbing, and seek medical attention.",
  "hypothermia": "Warm the person slowly, cover with blankets, and seek immediate medical help.",
  "burns": "Cool under running water for 10 minutes, cover with a clean cloth, and do not apply ice.",
  "fracture": "Immobilize the area, apply cold packs, and seek medical care.",
  "sprain": "Rest, ice, compression, elevation (RICE method).",
  "strain": "Rest the muscle, apply cold packs, and avoid heavy lifting.",
  "stroke": "Emergency condition — seek medical help immediately.",
  "heart attack": "Emergency — call emergency services immediately.",
  "anxiety": "Practice deep breathing, meditation, and consult a therapist if severe.",
  "depression": "Talk to a mental health professional, maintain routine, and exercise regularly.",
  "insomnia": "Maintain a sleep schedule, avoid caffeine, and practice relaxation techniques.",
  "stress": "Practice yoga, meditation, and engage in physical activity.",
  "fatigue": "Rest well, eat a balanced diet, and exercise regularly.",
  "dizziness": "Sit or lie down immediately, hydrate, and seek help if recurrent.",
  "motion sickness": "Look at the horizon, take prescribed anti-sickness medication.",
  "ear infection": "Consult a doctor, avoid inserting objects into ears.",
  "hearing loss": "Avoid loud noises, use hearing aids if prescribed.",
  "eye strain": "Follow the 20-20-20 rule, adjust screen brightness, and rest your eyes.",
  "conjunctivitis": "Clean eyes with cold water, avoid touching, and consult a doctor.",
  "glaucoma": "Use prescribed eye drops, get regular check-ups.",
  "cataract": "Consult an eye doctor for surgery if needed.",
  "skin rash": "Keep area clean, apply soothing lotion, and avoid irritants.",
  "eczema": "Moisturize skin, avoid triggers, and use prescribed creams.",
  "psoriasis": "Moisturize skin, manage stress, and use prescribed medication.",
  "acne": "Wash face gently, avoid oily products, and use topical treatments.",
  "chickenpox": "Rest, avoid scratching, and use calamine lotion.",
  "measles": "Rest, drink fluids, and consult a doctor.",
  "mumps": "Rest, drink fluids, and use cold compress for swelling.",
  "tuberculosis": "Take prescribed antibiotics for full duration, rest, and maintain good nutrition.",
  "malaria": "Take prescribed antimalarial drugs, rest, and stay hydrated.",
  "dengue": "Drink plenty of fluids, take paracetamol for fever, and avoid aspirin.",
  "typhoid": "Take prescribed antibiotics, drink boiled water, and eat soft foods.",
  "hepatitis": "Rest, avoid alcohol, eat a healthy diet, and take prescribed medicines.",
  "HIV/AIDS": "Take antiretroviral therapy as prescribed, eat healthy, and practice safe lifestyle.",
  "COVID-19": "Rest, drink fluids, isolate, and consult a doctor if symptoms worsen.",
  "sinusitis": "Steam inhalation, nasal spray, and consult a doctor if chronic.",
  "appendicitis": "Seek immediate medical help — surgery may be required.",
  "kidney stones": "Drink plenty of water, take prescribed pain relievers, and consult a doctor.",
  "urinary tract infection": "Drink water, maintain hygiene, and take antibiotics as prescribed.",
  "menstrual cramps": "Apply heat to the abdomen, take mild pain relief, and exercise gently.",
  "PMS": "Exercise, eat healthy, and practice relaxation techniques.",
  "pregnancy nausea": "Eat small frequent meals, avoid strong odors, and consult a doctor if severe.",
  "high cholesterol": "Eat a low-fat diet, exercise, and take medication if prescribed.",
  "thyroid disorder": "Take thyroid medication as prescribed, eat iodine-rich food.",
  "goiter": "Consult a doctor, take iodine supplements if prescribed.",
  "liver disease": "Avoid alcohol, eat a balanced diet, and consult a doctor.",
  "cirrhosis": "Avoid alcohol, take prescribed medications, and consult a specialist.",
  "pancreatitis": "Avoid alcohol, follow a low-fat diet, and seek medical help.",
  "gout": "Avoid red meat and alcohol, drink water, and take prescribed medication.",
  "ringworm": "Keep skin clean and dry, use antifungal cream as prescribed.",
  "jaundice": "Rest, avoid alcohol, eat a healthy diet, and consult a doctor.",
  "piles": "Eat fiber-rich foods, drink water, avoid straining during bowel movements.",
  "hernia": "Avoid heavy lifting, wear supportive belt, surgery may be needed.",
  "varicose veins": "Exercise, elevate legs, wear compression stockings.",
  "epilepsy": "Take antiepileptic drugs as prescribed, avoid triggers.",
  "Parkinson's disease": "Take prescribed medication, physiotherapy, and regular check-ups.",
  "Alzheimer's disease": "Maintain a healthy lifestyle, cognitive exercises, and prescribed treatment.",
  "multiple sclerosis": "Physiotherapy, prescribed drugs, and lifestyle changes.",
  "cervical spondylosis": "Exercise neck gently, maintain posture, and take pain relief if needed.",
  "sciatica": "Physiotherapy, hot/cold compress, and prescribed medication.",
  "carpal tunnel syndrome": "Rest wrist, use splints, and consider physiotherapy."
  "meningitis": "Seek immediate medical attention, rest, and follow prescribed antibiotics or antivirals.",
  "encephalitis": "Seek emergency care, rest, and follow prescribed antiviral medications.",
  "rabies": "Emergency — wash wound with soap and water, get immediate vaccination.",
  "tetanus": "Seek urgent medical care, tetanus vaccination required.",
  "diphtheria": "Seek medical help immediately, follow prescribed antibiotics and antitoxin.",
  "whooping cough": "Rest, stay hydrated, and take prescribed antibiotics.",
  "polio": "Seek medical care, supportive treatment, and physical therapy.",
  "leprosy": "Take prescribed antibiotics for full course, maintain hygiene.",
  "cholera": "Drink ORS, antibiotics may be required, maintain hydration.",
  "plague": "Seek urgent medical help, antibiotics required.",
  "ebola": "Seek emergency care, supportive treatment, isolation necessary.",
  "zika virus": "Rest, drink fluids, take paracetamol, avoid mosquito bites.",
  "chikungunya": "Drink fluids, take paracetamol, avoid aspirin.",
  "yellow fever": "Rest, drink fluids, vaccination is preventive.",
  "swine flu": "Rest, take antivirals if prescribed, and avoid spreading infection.",
  "bird flu": "Seek immediate medical help, antivirals may be required.",
  "H1N1 influenza": "Rest, stay hydrated, and take antivirals if prescribed.",
  "hand foot mouth disease": "Drink fluids, eat soft foods, and rest.",
  "scarlet fever": "Consult a doctor, take prescribed antibiotics.",
  "rheumatic fever": "Consult a doctor, rest, and take antibiotics and anti-inflammatory drugs.",
  "tonsillitis": "Gargle with warm salt water, rest, and take antibiotics if prescribed.",
  "laryngitis": "Rest voice, drink warm fluids, avoid smoking.",
  "pharyngitis": "Gargle with salt water, drink fluids, and rest.",
  "otitis media": "Consult a doctor, antibiotics may be prescribed.",
  "sinus headache": "Steam inhalation, nasal spray, and pain relief.",
  "vertigo": "Sit or lie down, avoid sudden movements, and consult a doctor.",
  "meniere’s disease": "Low-salt diet, avoid caffeine, and consult a doctor.",
  "tinnitus": "Avoid loud noise, reduce caffeine, and consult a doctor.",
  "eye infection": "Wash eyes with clean water, avoid rubbing, consult a doctor.",
  "dry eyes": "Use lubricating eye drops, avoid long screen use.",
  "corneal ulcer": "Consult an eye specialist immediately.",
  "blepharitis": "Clean eyelids with warm compress, consult a doctor.",
  "retinal detachment": "Seek emergency medical help immediately.",
  "macular degeneration": "Consult an eye specialist, take prescribed supplements.",
  "keratitis": "Consult a doctor, use prescribed eye drops.",
  "iritis": "Consult an ophthalmologist, prescribed steroid drops may be required.",
  "color blindness": "No cure, use corrective lenses if prescribed.",
  "night blindness": "Eat vitamin A rich food, consult a doctor.",
  "leukemia": "Consult an oncologist, follow prescribed chemotherapy.",
  "lymphoma": "Consult a specialist, follow prescribed chemotherapy or radiation.",
  "skin cancer": "Avoid sun, consult oncologist, surgery or radiation may be needed.",
  "breast cancer": "Consult oncologist, treatment includes surgery, chemo, radiation.",
  "lung cancer": "Avoid smoking, consult specialist, follow prescribed treatment.",
  "colon cancer": "Consult oncologist, surgery/chemo may be needed.",
  "prostate cancer": "Consult doctor, treatment may include surgery or medication.",
  "ovarian cancer": "Consult oncologist, follow prescribed treatment.",
  "cervical cancer": "Consult doctor, HPV vaccination is preventive.",
  "pancreatic cancer": "Consult oncologist, treatment varies.",
  "liver cancer": "Consult specialist, treatment depends on stage.",
  "kidney cancer": "Consult doctor, surgery may be required.",
  "bladder cancer": "Consult oncologist, treatment includes surgery or chemo.",
  "brain tumor": "Consult neurologist/oncologist, surgery or radiation may be needed.",
  "oral cancer": "Avoid tobacco/alcohol, consult specialist.",
  "throat cancer": "Consult oncologist, follow prescribed treatment.",
  "esophageal cancer": "Consult doctor, surgery/chemo may be required.",
  "stomach cancer": "Consult specialist, follow treatment plan.",
  "testicular cancer": "Consult doctor, surgery may be required.",
  "bone cancer": "Consult oncologist, treatment includes chemo/radiation.",
  "melanoma": "Avoid sun exposure, consult specialist.",
  "leukoplakia": "Avoid tobacco, consult dentist.",
  "psoriatic arthritis": "Take prescribed medication, physiotherapy, maintain healthy lifestyle.",
  "rheumatoid arthritis": "Take anti-inflammatory drugs, physiotherapy, consult doctor.",
  "lupus": "Take prescribed medication, avoid sun, regular checkups.",
  "scleroderma": "Consult rheumatologist, follow treatment.",
  "fibromyalgia": "Exercise, reduce stress, take pain relief as prescribed.",
  "chronic fatigue syndrome": "Rest, stress management, consult doctor.",
  "gallstones": "Avoid fatty foods, consult doctor, surgery may be required.",
  "hemochromatosis": "Avoid iron supplements, consult doctor.",
  "wilson’s disease": "Avoid copper-rich foods, take prescribed medication.",
  "celiac disease": "Avoid gluten, eat gluten-free food.",
  "crohn’s disease": "Eat low-fiber food during flare-ups, take prescribed meds.",
  "ulcerative colitis": "Eat light meals, take prescribed medication.",
  "irritable bowel syndrome": "Eat fiber-rich foods, manage stress, consult doctor.",
  "diverticulitis": "Eat liquid diet during flare-ups, antibiotics may be needed.",
  "colon polyps": "Consult doctor, regular colonoscopy may be required.",
  "hemophilia": "Avoid injuries, take clotting factor replacement as prescribed.",
  "thalassemia": "Regular blood transfusion, consult doctor.",
  "sickle cell anemia": "Drink water, avoid stress, take prescribed medication.",
  "vitamin D deficiency": "Get sunlight, take supplements.",
  "vitamin B12 deficiency": "Eat animal products, take supplements.",
  "vitamin C deficiency": "Eat citrus fruits, take supplements.",
  "rickets": "Eat vitamin D and calcium-rich food, consult doctor.",
  "scurvy": "Eat citrus fruits, take vitamin C supplements.",
  "pellagra": "Eat niacin-rich foods, take supplements.",
  "kwashiorkor": "Eat protein-rich foods, consult doctor.",
  "marasmus": "Balanced diet, nutritional supplements.",
  "obstructive sleep apnea": "Lose weight, use CPAP machine, avoid alcohol.",
  "restless leg syndrome": "Exercise, massage legs, consult doctor.",
  "narcolepsy": "Maintain sleep schedule, take prescribed medication.",
  "jet lag": "Adjust sleep schedule, stay hydrated.",
  "altitude sickness": "Ascend gradually, stay hydrated, consult doctor.",
  "motion disorder": "Rest, consult a doctor, prescribed medication may be needed.",
  "gastroenteritis": "Drink fluids, eat bland foods, rest.",
  "dysentery": "Drink ORS, take prescribed antibiotics.",
  "tapeworm infection": "Maintain hygiene, take prescribed medication.",
  "roundworm infection": "Maintain hygiene, take deworming medicine.",
  "hookworm infection": "Wear footwear, take prescribed deworming drugs.",
  "pinworm infection": "Maintain hygiene, deworming medicine required.",
  "schistosomiasis": "Avoid contaminated water, consult doctor.",
  "elephantiasis": "Avoid mosquito bites, consult doctor.",
  "filariasis": "Avoid mosquito bites, prescribed medication needed.",
  "leishmaniasis": "Avoid sandfly bites, consult doctor.",
  "trachoma": "Maintain hygiene, consult doctor.",
  "onchocerciasis": "Avoid blackfly bites, consult doctor.",
  "lyme disease": "Avoid tick bites, take antibiotics as prescribed.",
  "rocky mountain spotted fever": "Seek medical help, antibiotics required.",
  "syphilis": "Take antibiotics as prescribed, practice safe lifestyle.",
  "gonorrhea": "Consult doctor, take antibiotics.",
  "chlamydia": "Consult doctor, antibiotics required.",
  "genital herpes": "Take antivirals, practice safe lifestyle.",
  "HPV infection": "Vaccination preventive, consult doctor if warts appear."
  "trichomoniasis": "Consult doctor, take prescribed antibiotics.",
  "bacterial vaginosis": "Take prescribed antibiotics, maintain hygiene.",
  "yeast infection": "Use antifungal creams or oral medicine as prescribed.",
  "pelvic inflammatory disease": "Consult doctor, antibiotics required.",
  "endometriosis": "Pain management, hormone therapy, consult doctor.",
  "polycystic ovary syndrome": "Maintain healthy weight, take prescribed medication.",
  "menstrual cramps": "Use heating pad, take pain relief medicine.",
  "premenstrual syndrome": "Exercise, healthy diet, manage stress.",
  "menopause symptoms": "Hormone therapy, lifestyle changes.",
  "erectile dysfunction": "Consult doctor, medications available.",
  "benign prostatic hyperplasia": "Consult urologist, take prescribed medication.",
  "urinary tract infection": "Drink plenty of water, take antibiotics.",
  "kidney stones": "Drink lots of water, pain relief, consult doctor.",
  "nephrotic syndrome": "Consult doctor, take prescribed medicines.",
  "glomerulonephritis": "Consult doctor, rest, and prescribed treatment.",
  "acute kidney injury": "Seek urgent medical help.",
  "chronic kidney disease": "Maintain diet, avoid salt, follow doctor’s advice.",
  "dialysis patient care": "Maintain hygiene, follow doctor’s schedule strictly.",
  "hepatitis A": "Drink fluids, avoid alcohol, rest.",
  "hepatitis B": "Consult doctor, antivirals may be required.",
  "hepatitis C": "Consult doctor, antivirals are available.",
  "hepatitis D": "Seek medical care, prevent via vaccination.",
  "hepatitis E": "Drink clean water, rest, avoid alcohol.",
  "liver cirrhosis": "Avoid alcohol, eat healthy diet, consult doctor.",
  "fatty liver disease": "Maintain healthy weight, avoid alcohol.",
  "jaundice": "Rest, drink fluids, consult doctor.",
  "gastritis": "Eat bland diet, avoid spicy foods, take prescribed meds.",
  "peptic ulcer": "Avoid NSAIDs, alcohol, take prescribed medicine.",
  "GERD": "Avoid late-night meals, take antacids if prescribed.",
  "hiatal hernia": "Eat small meals, avoid lying down after food.",
  "appendicitis": "Seek urgent surgery consultation.",
  "peritonitis": "Seek emergency medical help immediately.",
  "pancreatitis": "Hospital care, avoid alcohol, follow doctor’s advice.",
  "constipation": "Eat fiber-rich foods, drink water, exercise.",
  "diarrhea": "Drink ORS, eat light foods.",
  "food poisoning": "Drink fluids, rest, consult doctor if severe.",
  "lactose intolerance": "Avoid dairy, use lactose-free products.",
  "gout": "Avoid purine-rich foods, take prescribed meds.",
  "bursitis": "Rest joint, use ice packs, consult doctor.",
  "tendinitis": "Rest affected area, apply ice, physiotherapy.",
  "carpal tunnel syndrome": "Rest wrist, use wrist splint, consult doctor.",
  "frozen shoulder": "Do physiotherapy, apply heat, consult doctor.",
  "sciatica": "Physiotherapy, pain relief medication.",
  "hernia": "Avoid heavy lifting, consult surgeon.",
  "varicose veins": "Wear compression stockings, elevate legs.",
  "deep vein thrombosis": "Seek medical help, take prescribed blood thinners.",
  "pulmonary embolism": "Emergency medical help required.",
  "anxiety disorder": "Practice relaxation, consult therapist, medications if needed.",
  "depression": "Seek counseling, exercise, prescribed antidepressants may help.",
  "bipolar disorder": "Consult psychiatrist, follow prescribed medication.",
  "schizophrenia": "Consult psychiatrist, follow treatment strictly.",
  "OCD": "Therapy and medication as prescribed.",
  "PTSD": "Therapy, relaxation, support groups, medication if needed.",
  "ADHD": "Consult doctor, therapy and medications help.",
  "autism": "Early intervention, therapy, support care.",
  "insomnia": "Maintain sleep schedule, avoid caffeine.",
  "migraine": "Rest in dark room, avoid triggers, take prescribed meds.",
  "cluster headache": "Seek medical advice, oxygen therapy may help.",
  "tension headache": "Rest, massage, pain relievers if needed.",
  "epilepsy": "Take antiepileptic medication regularly.",
  "stroke": "Seek emergency care immediately.",
  "transient ischemic attack": "Consult doctor urgently, preventive medication needed.",
  "parkinson’s disease": "Take prescribed medicine, physiotherapy.",
  "alzheimer’s disease": "Cognitive therapy, support care, prescribed medicines.",
  "dementia": "Supportive care, medications may help.",
  "multiple sclerosis": "Consult neurologist, follow prescribed treatment.",
  "ALS": "Supportive therapy, consult neurologist.",
  "spinal cord injury": "Seek emergency care, physiotherapy needed.",
  "concussion": "Rest, avoid screens, consult doctor.",
  "traumatic brain injury": "Emergency care required.",
  "heat stroke": "Move to cool place, drink fluids, seek urgent care.",
  "hypothermia": "Warm body gradually, seek medical help.",
  "frostbite": "Warm affected area slowly, consult doctor.",
  "burn injury": "Cool burn with water, cover with clean cloth, seek care.",
  "sunburn": "Apply aloe vera, stay hydrated.",
  "snake bite": "Keep still, seek emergency care immediately.",
  "dog bite": "Wash wound, take rabies vaccination.",
  "cat scratch disease": "Clean wound, take prescribed antibiotics.",
  "scorpion sting": "Apply cold pack, seek medical care.",
  "bee sting": "Remove stinger, apply ice, take antihistamine.",
  "wasp sting": "Apply cold compress, pain relief medicine.",
  "allergic rhinitis": "Avoid allergens, take antihistamines.",
  "hay fever": "Avoid pollen, wear mask, take antihistamines.",
  "food allergy": "Avoid trigger food, keep epinephrine auto-injector.",
  "drug allergy": "Stop medicine, consult doctor immediately.",
  "anaphylaxis": "Use epinephrine immediately, seek emergency care.",
  "eczema": "Apply moisturizer, avoid triggers, take prescribed creams.",
  "psoriasis": "Apply medicated creams, avoid stress, consult doctor.",
  "hives": "Avoid allergen, take antihistamines.",
  "dermatitis": "Use mild soap, apply prescribed creams.",
  "ringworm": "Apply antifungal cream, maintain hygiene.",
  "athlete’s foot": "Apply antifungal cream, keep feet dry.",
  "jock itch": "Apply antifungal cream, wear loose clothing.",
  "warts": "Consult doctor, cryotherapy may help.",
  "chickenpox": "Rest, avoid scratching, take paracetamol.",
  "measles": "Rest, hydration, vitamin A supplements.",
  "mumps": "Rest, fluids, pain relief medicine.",
  "rubella": "Rest, consult doctor, vaccination preventive.",
  "smallpox": "Eradicated, but vaccination preventive historically.",
  "typhoid": "Drink fluids, antibiotics required.",
  "paratyphoid fever": "Consult doctor, antibiotics required.",
  "brucellosis": "Consult doctor, prescribed antibiotics needed.",
  "anthrax": "Seek urgent medical care, antibiotics required.",
  "tuberculosis": "Take prescribed antibiotics for full course.",
  "multi-drug resistant TB": "Follow doctor’s strict treatment plan.",
  "latent TB": "Take preventive medicines as prescribed.",
  "hantavirus": "Avoid rodent exposure, seek urgent care.",
  "dengue hemorrhagic fever": "Seek urgent medical care, hydration important.",
  "malaria falciparum": "Seek urgent medical help, antimalarials required.",
  "malaria vivax": "Consult doctor, antimalarial treatment needed.",
  "malaria malariae": "Seek medical care, treatment required.",
  "malaria ovale": "Consult doctor, prescribed medicine needed."




}
